<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [ ]:
import pandas as pd
import psycopg2

In [ ]:
!pip install sqlalchemy

[notice] A new release of pip is available: 23.0.1 -> 23.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: sqlalchemy in c:\users\sergk\appdata\local\programs\python\python310\lib\site-packages (2.0.15)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\sergk\appdata\local\programs\python\python310\lib\site-packages (from sqlalchemy) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\sergk\appdata\local\programs\python\python310\lib\site-packages (from sqlalchemy) (4.6.3)

In [ ]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
conn_str = 'postgresql+psycopg2://skillfactory:cCkxxLVrDE8EbvjueeMedPKt@84.201.134.129:5432/project_sql'

In [ ]:
n = 10
queryp = f'''select *
           from 
           sql.pokemon
           limit {n}
        '''

In [ ]:
query = f'''select *
           from areas
        '''

In [ ]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df = pd.read_sql_query(query, conn_str)
df

        id              name
0     2758           Тбилиси
1        8            Майкоп
2     1180          Нерюнгри
3     1240       Новокузнецк
4        2   Санкт-Петербург
...    ...               ...
1357  5043  Звёздный Городок
1358  3934       Воротынск\n
1359  4825             Чемал
1360  3708         Усть-Нера
1361  2432         Каневская

[1362 rows x 2 columns]

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [ ]:
# текст запроса
query_3_1= f'''select count(id)
from vacancies 

'''

In [ ]:
# результат запроса
df=pd.read_sql_query(query_3_1,conn_str)
df

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [ ]:
# текст запроса
query_3_2= f'''select count(id)
from employers 

'''

In [ ]:
# результат запроса
df=pd.read_sql_query(query_3_2,conn_str)
df

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [ ]:
# текст запроса
query_3_3= f'''select count(id)
from  areas

'''

In [ ]:
# результат запроса
df=pd.read_sql_query(query_3_3,conn_str)
df

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [ ]:
# текст запроса
query_3_4= f'''select count(id)
from  INDUSTRIES

'''

In [ ]:
# результат запроса 
df=pd.read_sql_query(query_3_4,conn_str)
df

   count
0    294

***

In [ ]:
# выводы по предварительному анализу данных

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [ ]:
# текст запроса
query_4_1= f'''select 
                
                COUNT(v.id), a.name
                from public.vacancies v
                join public.areas a on v.area_id = a.id
                group by a.name
                order by 1 desc
'''

In [ ]:
# результат запроса
df=pd.read_sql_query(query_4_1,conn_str)
df

     count             name
0     5333           Москва
1     2851  Санкт-Петербург
2     2112            Минск
3     2006      Новосибирск
4     1892           Алматы
..     ...              ...
764      1       Тарко-Сале
765      1    Новоаннинский
766      1            Бирск
767      1           Сасово
768      1             Анна

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [ ]:
# текст запроса 
query_4_2= f'''select 
                    name,
                    salary_from,
                    salary_to
                    from vacancies
                     where (salary_from IS not NULL) or (salary_to IS not NULL)
                   
                
               
'''

In [ ]:
# результат запроса
df=pd.read_sql_query(query_4_2,conn_str)
df

,name,salary_from,salary_to
0,Компьютерный Мастер,64000.0,NaN
1,Специалист службы поддержки с техническими зна...,15000.0,NaN
2,Инженер-программист,40000.0,60000.0
3,Системный администратор,50000.0,NaN
4,Ведущий программист 1C,150000.0,NaN
...,...,...,...
24068,Специалист сопровождения медицинской информаци...,50000.0,NaN
24069,Аналитик бизнес-процессов,102500.0,NaN
24070,Технический писатель (Платформа СБИС),40000.0,78000.0
24071,Начальник сервисной службы,60000.0,NaN
24072,Senior IOS разработчик,146456.0,244094.0

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [ ]:
# текст запроса
query_4_3= f'''select 
                    avg(salary_from) as avg_salary_ftom,
                    avg(salary_to)as avg_salary_to
                    from vacancies
                    
                   
                
               
'''

In [ ]:
# результат запроса
df=pd.read_sql_query(query_4_3,conn_str)
df

   avg_salary_ftom  avg_salary_to
0     71064.657901  110536.741923

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [ ]:
# текст запроса
query_4_4= f'''select  
                    schedule,
                    employment,
                    COUNT(NAME) as count_vac
                    from vacancies
                    GROUP BY schedule,employment
                    ORDER BY COUNT(NAME) DESC
                    limit 10
                    
                   
                
               
'''

In [ ]:
# результат запроса
df=pd.read_sql_query(query_4_4,conn_str)
df

           schedule           employment  count_vac
0       Полный день     Полная занятость      35367
1  Удаленная работа     Полная занятость       7802
2     Гибкий график     Полная занятость       1593
3  Удаленная работа  Частичная занятость       1312
4    Сменный график     Полная занятость        940
5       Полный день           Стажировка        569
6    Вахтовый метод     Полная занятость        367
7       Полный день  Частичная занятость        347
8     Гибкий график  Частичная занятость        312
9       Полный день     Проектная работа        141

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [ ]:
# текст запроса
query_4_5= f'''select
                    experience,
                    COUNT(NAME) as count_vac
                    from vacancies
                    GROUP BY experience
                    ORDER BY COUNT(NAME) 
                    
                    

                    
                   
                
               
'''

In [ ]:
# результат запроса
df=pd.read_sql_query(query_4_5,conn_str)
df

           experience  count_vac
0         Более 6 лет       1337
1           Нет опыта       7197
2       От 3 до 6 лет      14511
3  От 1 года до 3 лет      26152

### выводы по детальному анализу вакансий
В крупных городах вакансий больше, это ожидаемо. 
Вакансий с Полной занятостью и полным рабочим днем почти в 4.5 раза больше чем удаленный график с полной занятостью.  
Опыт работы от 1 года до 3 лет  требуется в большинстве вакансий.

***

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [ ]:
# текст запроса
query_5_1= f'''select
                    e.name,
                    COUNT(v.id) as count_vac
                    from vacancies v
                    join EMPLOYERS e on v.EMPLOYER_id = e.id
                group by e.name
                order by 2 desc
                
                limit 5
                               
               
'''

In [ ]:
# результат запроса
df=pd.read_sql_query(query_5_1,conn_str)
df

            name  count_vac
0         Яндекс       1933
1     Ростелеком        491
2       Тинькофф        444
3           СБЕР        428
4  Газпром нефть        331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [ ]:
# текст запроса
query_5_2= f'''select
                    a.name,
                    COUNT(DISTINCT e.id) as count_empl,
                    COUNT( v.name) as count_vac
                    from areas a
                    join EMPLOYERS e on e.area=a.id
                    left join vacancies v on v.area_id=a.id
                    group by a.name
                    order by 2 desc
                    limit 10
                               
               
'''

In [ ]:
# результат запроса
df=pd.read_sql_query(query_5_2,conn_str)
df

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [ ]:
# текст запроса
query_5_3 = f'''select DISTINCT
                e.name, 
                count(DISTINCT v.area_id) 
                from employers e 
                join vacancies v on e.id=v.employer_id 
                group by e.id 
                order by 2 desc 

'''

In [ ]:
# результат запроса
df=pd.read_sql_query(query_5_3,conn_str)
df

                          name  count
0                       Яндекс    181
1                   Ростелеком    152
2                   Спецремонт    116
3       Поляков Денис Иванович     88
4                    ООО ЕФИН      71
...                        ...    ...
14799     Яроцкий Е. В./ MoonX      1
14800  Ясли-сад №374 г. Минска      1
14801                      ЯСП      1
14802        Ястро-Переработка      1
14803                     ЯТСС      1

[14804 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [ ]:
# текст запроса

In [ ]:
# результат запроса

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [ ]:
# текст запроса

In [ ]:
# результат запроса

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [ ]:
# текст запроса

In [ ]:
# результат запроса

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [ ]:
# код для получения списка городов-милионников

In [ ]:
# текст запроса

In [ ]:
# результат запроса

***

In [ ]:
# выводы по анализу работодателей

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [ ]:
# текст запроса

In [ ]:
# результат запроса

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [ ]:
# текст запроса

In [ ]:
# результат запроса

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [ ]:
# текст запроса

In [ ]:
# результат запроса

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [ ]:
# текст запроса

In [ ]:
# результат запроса

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [ ]:
# текст запроса

In [ ]:
# результат запроса

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [ ]:
# текст запроса

In [ ]:
# результат запроса

***

In [ ]:
# выводы по предметному анализу

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования